{"class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_4", 0, 0]], "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 10], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "dense_1", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_1", "units": 64, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_2", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_2", "units": 64, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_3", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_3", "units": 64, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_4", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_4", "units": 1, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense"}]}, "keras_version": "2.0.8", "backend": "tensorflow"}